In [183]:
import pandas as pd

## Criando um DataFrame

In [184]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [185]:
data = pd.DataFrame(data,list('321'),list('ZYX'))

In [186]:
data

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

## Utilizando o sort_index( )

In [187]:
data.sort_index(inplace = True) #implace organiza pelo index

In [188]:
data.sort_index(inplace = False, axis = 1)
data

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [189]:
data.sort_index(inplace=True, axis = 1) #axis organiza a coluna indice if (inplace = True)
data

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

## Utilizando o sort_values( )

In [202]:
data.sort_values(by = 'Y')

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [205]:
data.sort_values(by = '1',axis = 1)

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [206]:
data

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3